Дошкольное_учреждение83/src/Documents/удуЗаявкаНаЗачислениеРебенкаВДОУ/удуЗаявкаНаЗачислениеРебенкаВДОУ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>удуЗаявкаНаЗачислениеРебенкаВДОУ</name>
  <posting>Deny</posting>
  <attributes>
    <name>Ребенок</name>
    <type>
      <types>CatalogRef.удуДети</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрацииВОчередь</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПланируемогоПоступления</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Учреждение</name>
    <type>
      <types>CatalogRef.удуУчреждения</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаЖелаемая</name>
    <type>
      <types>CatalogRef.удуГруппыУчреждения</types>
    </type>
  </attributes>
  <attributes>
    <name>РодительПодавшийЗаявку</name>
    <type>
      <types>CatalogRef.удуРодители</types>
    </type>
  </attributes>
  <attributes>
    <name>НачальнаяДатаЯвкиРодителя</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонечнаяДатаЯвкиРодителя</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФактическаяДатаЯвкиРодителя</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПризнакВозможностиНеЗачисления</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыдачиУведомления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РодительДляУведомления</name>
    <type>
      <types>CatalogRef.удуРодители</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыдачиНаправления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РодительДляНаправления</name>
    <type>
      <types>CatalogRef.удуРодители</types>
    </type>
  </attributes>
  <attributes>
    <name>ПризнакЗачисления</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПризнакОтказаВЗачислении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтказаВЗачислении</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОтказаВЗачислении</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФИОЛицаСнявшегоЗаявку</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаПоФактуЗачисления</name>
    <type>
      <types>CatalogRef.удуГруппыУчреждения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВозрастнойПризнак</name>
    <type>
      <types>CatalogRef.удуВозрастныеПризнаки</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЛьготыПоЗаявке</name>
    <attributes>
      <name>Льгота</name>
      <type>
        <types>CatalogRef.удуЛьготыПоЗачислению</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДокумента</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОрганВыдавшийДокумент</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыОснования</name>
    <attributes>
      <name>НаименованиеДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДокумента</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОрганВыдавшийДокумент</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Дошкольное_учреждение83/src/Documents/удуДоговорОЗачисленииРебенка/удуДоговорОЗачисленииРебенка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>удуДоговорОЗачисленииРебенка</name>
  <basedOn>Document.удуЗаявкаНаЗачислениеРебенкаВДОУ</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>Учреждение</name>
    <type>
      <types>CatalogRef.удуУчреждения</types>
    </type>
  </attributes>
  <attributes>
    <name>Ребенок</name>
    <type>
      <types>CatalogRef.удуДети</types>
    </type>
  </attributes>
  <attributes>
    <name>Группа</name>
    <type>
      <types>CatalogRef.удуГруппыУчреждения</types>
    </type>
  </attributes>
  <attributes>
    <name>Родитель</name>
    <type>
      <types>CatalogRef.удуРодители</types>
    </type>
  </attributes>
  <attributes>
    <name>СодержаниеДоговора</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОплатаПоДоговору</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроизошлоЗачисление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизошлоОтчисление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПризнакФормированияБезЗаявки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаявкаОснование</name>
    <type>
      <types>DocumentRef.удуЗаявкаНаЗачислениеРебенкаВДОУ</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСтавкиОплаты</name>
    <type>
      <types>EnumRef.удуВидыСтавокРодительскойПлаты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДокументыОснования</name>
    <attributes>
      <name>НаименованиеДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДокумента</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОрганВыдавшийДокумент</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Дошкольное_учреждение83/src/Documents/удуЗаявкаНаЗачислениеРебенкаВДОУ/Forms/ФормаСписка/Module.bsl
&НаСервере
Процедура УстановитьБыстрыйОтборВСписке(ВидОтбора)
	Если ВидОтбора = "Отображать все заявки на зачисление" Тогда
		ОбщегоНазначенияКлиентСервер.УдалитьОтборУСписка(Список.Отбор, Новый ПолеКомпоновкиДанных("Ссылка"));
		
	ИначеЕсли ВидОтбора = "Отображать заявки, принятые на рассмотрение" Тогда
		ТекстЗапроса = "ВЫБРАТЬ
		               |	удуЗаявкаНаЗачислениеРебенкаВДОУ.Ссылка
		               |ИЗ
		               |	Документ.удуЗаявкаНаЗачислениеРебенкаВДОУ КАК удуЗаявкаНаЗачислениеРебенкаВДОУ
		               |ГДЕ
		               |	(НЕ удуЗаявкаНаЗачислениеРебенкаВДОУ.ПризнакЗачисления)
		               |	И (НЕ удуЗаявкаНаЗачислениеРебенкаВДОУ.ПризнакОтказаВЗачислении)";
					   
		Запрос = Новый Запрос(ТекстЗапроса);
		РезультатЗапроса = Запрос.Выполнить().Выгрузить();
		
		СписокЗаявокДляОтбора = Новый СписокЗначений;
		Для Каждого СтрокаРеузльтата Из РезультатЗапроса Цикл
			СписокЗаявокДляОтбора.Добавить(СтрокаРеузльтата.Ссылка);
		КонецЦикла;
					   
		ОбщегоНазначенияКлиентСервер.УстановитьОтборУСпискаВСписке(Список.Отбор, Новый ПолеКомпоновкиДанных("Ссылка"), СписокЗаявокДляОтбора);
		
	ИначеЕсли ВидОтбора = "Отображать заявки, по которым произошло зачисление" Тогда
		ТекстЗапроса = "ВЫБРАТЬ
		               |	удуЗаявкаНаЗачислениеРебенкаВДОУ.Ссылка
		               |ИЗ
		               |	Документ.удуЗаявкаНаЗачислениеРебенкаВДОУ КАК удуЗаявкаНаЗачислениеРебенкаВДОУ
		               |ГДЕ
		               |	удуЗаявкаНаЗачислениеРебенкаВДОУ.ПризнакЗачисления";
					   
		Запрос = Новый Запрос(ТекстЗапроса);
		РезультатЗапроса = Запрос.Выполнить().Выгрузить();
		
		СписокЗаявокДляОтбора = Новый СписокЗначений;
		Для Каждого СтрокаРеузльтата Из РезультатЗапроса Цикл
			СписокЗаявокДляОтбора.Добавить(СтрокаРеузльтата.Ссылка);
		КонецЦикла;
					   
		ОбщегоНазначенияКлиентСервер.УстановитьОтборУСпискаВСписке(Список.Отбор, Новый ПолеКомпоновкиДанных("Ссылка"), СписокЗаявокДляОтбора);		
		
	ИначеЕсли ВидОтбора = "Отображать заявки, снятые с рассмотрения" Тогда
		ТекстЗапроса = "ВЫБРАТЬ
		               |	удуЗаявкаНаЗачислениеРебенкаВДОУ.Ссылка
		               |ИЗ
		               |	Документ.удуЗаявкаНаЗачислениеРебенкаВДОУ КАК удуЗаявкаНаЗачислениеРебенкаВДОУ
		               |ГДЕ
		               |	удуЗаявкаНаЗачислениеРебенкаВДОУ.ПризнакОтказаВЗачислении";
					   
		Запрос = Новый Запрос(ТекстЗапроса);
		РезультатЗапроса = Запрос.Выполнить().Выгрузить();
		
		СписокЗаявокДляОтбора = Новый СписокЗначений;
		Для Каждого СтрокаРеузльтата Из РезультатЗапроса Цикл
			СписокЗаявокДляОтбора.Добавить(СтрокаРеузльтата.Ссылка);
		КонецЦикла;
					   
		ОбщегоНазначенияКлиентСервер.УстановитьОтборУСпискаВСписке(Список.Отбор, Новый ПолеКомпоновкиДанных("Ссылка"), СписокЗаявокДляОтбора);		
		
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьПризнакОтказаВЗаявке(ПереданнаяЗаявка)
	Возврат ПереданнаяЗаявка.ПризнакОтказаВЗачислении;
КонецФункции

&НаСервере
Процедура ЗаполнитьНовыйОбъектНаСервере(ПереданнаяЗаявка)
	НовыйДоговор = Документы.удуДоговорОЗачисленииРебенка.СоздатьДокумент();
	НовыйДоговор.ЗаполнитьПоДокументуОснованию(ПереданнаяЗаявка);
	
	ЗначениеВРеквизитФормы(НовыйДоговор, "РеквизитДокументДоговор");
КонецПроцедуры

&НаСервере
Функция ПолучитьСведенияОДоговоре(ПереданнаяЗаявка)
	ТекстЗапроса = "ВЫБРАТЬ
	               |	удуДоговорОЗачисленииРебенка.Ссылка
	               |ИЗ
	               |	Документ.удуДоговорОЗачисленииРебенка КАК удуДоговорОЗачисленииРебенка
	               |ГДЕ
	               |	(НЕ удуДоговорОЗачисленииРебенка.ПометкаУдаления)
	               |	И удуДоговорОЗачисленииРебенка.ЗаявкаОснование = &ЗаявкаОснование
	               |	И (НЕ удуДоговорОЗачисленииРебенка.ПризнакФормированияБезЗаявки)";
				   
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ЗаявкаОснование", ПереданнаяЗаявка);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат.Количество();
	
КонецФункции	

&НаКлиенте
Процедура КомандаСоздатьНаОсновании(Команда)
	// Вставить содержимое обработчика.
	Если ПолучитьСведенияОДоговоре(Элементы.Список.ТекущаяСтрока) > 0 Тогда
		Вопрос("По выбранной заявке уже сформирован договор о зчислении ребенка в группу", РежимДиалогаВопрос.ОК);
	ИначеЕсли ПолучитьПризнакОтказаВЗаявке(Элементы.Список.ТекущаяСтрока) Тогда
		Вопрос("По выбранной заявке было отказано в зачислении ребенка в группу", РежимДиалогаВопрос.ОК);
	Иначе 
		ФормаНовогоДоговора = ПолучитьФорму("Документ.удуДоговорОЗачисленииРебенка.Форма.ФормаДокумента",,ЭтаФорма);
		ДокументОснование = Элементы.Список.ТекущаяСтрока;				
		ЗаполнитьНовыйОбъектНаСервере(ДокументОснование);				
		ФормаНовогоДоговора.Объект.Группа = РеквизитДокументДоговор.Группа;
		ФормаНовогоДоговора.Объект.Ребенок = РеквизитДокументДоговор.Ребенок;
		ФормаНовогоДоговора.Объект.Родитель = РеквизитДокументДоговор.Родитель;
		ФормаНовогоДоговора.Объект.Учреждение = РеквизитДокументДоговор.Учреждение;
		ФормаНовогоДоговора.Объект.ПризнакФормированияБезЗаявки = РеквизитДокументДоговор.ПризнакФормированияБезЗаявки;
		ФормаНовогоДоговора.Объект.ЗаявкаОснование = РеквизитДокументДоговор.ЗаявкаОснование;	
		
		ФормаНовогоДоговора.Открыть();		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомандаПечатьСпискаЗаявок(Команда)
	// Вставить содержимое обработчика.
	ФормаОтчета = ПолучитьФорму("Отчет.удуОтчетПоЗаявкамНаЗачислениеВГруппу.Форма.ФормаОтчета",,ЭтаФорма);
	ФормаОтчета.Открыть();
КонецПроцедуры

&НаКлиенте
Процедура СписокДляБыстрогоОтбораПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	УстановитьБыстрыйОтборВСписке(ЗначениеБыстрогоОтбораПоСостояниюЗаявки);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗначениеБыстрогоОтбораПоСостояниюЗаявки = "Отображать все заявки на зачисление, в т.ч. снятые с рассмотрения";
	
	// Обработчик подсистемы "Дополнительные отчеты и обработки"
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтаФорма);
КонецПроцедуры
